---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.IList{System.Double})
source: html/738e90e5-9924-8399-27ad-1a6e099f83e3.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute Method

## Syntax (C#)
```csharp
public void SetAttribute(
	string name,
	IList<double> values
)
```

## Parameters
- **name** (`System.String`)
- **values** (`System.Collections.Generic.IList < Double >`)